In [2448]:
# For install

# % pip install pandas

In [2449]:
# Using pandas

import pandas as pd

In [2450]:
# create a pandas Series
series = pd.Series([10, 20, 30, 40, 50])

print("series: \n", series)

print("=================================")

print("Type of series ", type(series))

series:
 0    10
1    20
2    30
3    40
4    50
dtype: int64
=================================
Type of series  <class 'pandas.Series'>

In [2451]:
# create another pandas Series with custom index
series_1 = pd.Series([5, 10, 15, 20, 25], index=['a', 'b', 'c', 'd', 'e'])

print("series 1: \n", series_1)

series 1:
 a     5
b    10
c    15
d    20
e    25
dtype: int64

In [2452]:
# create a DataFrame from list
data = [[1, 2, 3, 'a'],
        [4, 5, 6, 'b'],
        [7, 8, 9, 'c']]

In [2453]:
# create DataFrame with specified column names
df = pd.DataFrame(data, columns=["Column1", "Column2", "Column3", "Column4"])

# display the DataFrame
display(df) # display is used in Jupyter Notebooks, not like print -> print(df), but works too

   Column1  Column2  Column3 Column4
0        1        2        3       a
1        4        5        6       b
2        7        8        9       c

In [2454]:
# create another DataFrame from a dictionary
data_2 = {"Name": ["Alice", "Bob", "Charlie", "David"],
          "Age": [24, 27, 22, 32],
          "City": ["New York", "Los Angeles", "Chicago", "Houston"]}

df_2 = pd.DataFrame(data_2, columns=["Name", "Age", "City"], index=[1, 2, 3, 4])

# display the DataFrame
display(df_2)

      Name  Age         City
1    Alice   24     New York
2      Bob   27  Los Angeles
3  Charlie   22      Chicago
4    David   32      Houston

In [2455]:
# get the columns of the DataFrame
df_2.columns

Index(['Name', 'Age', 'City'], dtype='str')

In [2456]:
# get the index of the DataFrame
df_2.index #.tolist() - index

Index([1, 2, 3, 4], dtype='int64')

In [2457]:
# get the values of the DataFrame as a 2D array
df_2.values

array([['Alice', 24, 'New York'],
       ['Bob', 27, 'Los Angeles'],
       ['Charlie', 22, 'Chicago'],
       ['David', 32, 'Houston']], dtype=object)

In [2458]:
# get the data types of each column
df_2.dtypes

Name      str
Age     int64
City      str
dtype: object

In [2459]:
# priority of data types: object < string < float < int < bool
mixed_data = {'A': [1, 2, 3],
              'B': [4.0, 5.5, 6.1],
              'C': ['x', 'y', 'z'],
              'D': [True, False, True]}

df_mixed = pd.DataFrame(mixed_data)

print("Data type of mixed vector: \n", df_mixed.dtypes) # Output: object why? Because of column C

Data type of mixed vector:
 A      int64
B    float64
C        str
D       bool
dtype: object

In [2460]:
# get a specific column's data type
df['Column1'].dtype

dtype('int64')

In [2461]:
# convert a column to a different data type
df["Column1"] = df["Column1"].astype("category")

df["Column1"].dtype

CategoricalDtype(categories=[1, 4, 7], ordered=False, categories_dtype=int64)

In [2462]:
# get the first 5 rows of the DataFrame
df.head(1) # get first 1 row

c:\Users\dell\DEPI_ONL4_AIS2_S2\DEPI_ONL4_AIS2_S2_ML\DEPI_R4\Lib\site-packages\IPython\core\displayhook.py:292: UserWarning: Output cache limit (currently 1000 entries) hit.
Flushing oldest 200 entries.
  warn('Output cache limit (currently {sz} entries) hit.\n'

  Column1  Column2  Column3 Column4
0       1        2        3       a

In [2463]:
# get the last 5 rows of the DataFrame
df.tail(2) # last 2 rows

  Column1  Column2  Column3 Column4
1       4        5        6       b
2       7        8        9       c

In [2464]:
# get sample rows from the DataFrame
df.sample(3) # 3 random rows

  Column1  Column2  Column3 Column4
2       7        8        9       c
0       1        2        3       a
1       4        5        6       b

In [2465]:
# get summary statistics of the DataFrame
df.describe() # for numerical columns by default

       Column2  Column3
count      3.0      3.0
mean       5.0      6.0
std        3.0      3.0
min        2.0      3.0
25%        3.5      4.5
50%        5.0      6.0
75%        6.5      7.5
max        8.0      9.0

In [2466]:
# get summary statistics of the categorical columns
df.describe(include="category") # include='category' to get stats for categorical columns only, # include='all' to get stats for all columns

        Column1
count         3
unique        3
top           1
freq          1

In [2467]:
# perform operations on a specific column
df["Column2"].unique().sum() # sum of unique values in Column2, used in numerical analysis, operations-> (min, max, mean, median, mode, sum, count, std, var, etc.)

np.int64(15)

In [2468]:
# get the data type of a specific column
df["Column1"].dtype

# get the index of the maximum value in Column1
df["Column1"].idxmax()  # get the index of the maximum value in Column1, works for numerical columns only

2

In [2469]:
# get info about the DataFrame
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  3 non-null      category
 1   Column2  3 non-null      int64
 2   Column3  3 non-null      int64
 3   Column4  3 non-null      str
dtypes: category(1), int64(2), str(1)
memory usage: 231.0 bytes

In [2470]:
# get the count of unique values in Column1
df["Column1"].value_counts()

Column1
1    1
4    1
7    1
Name: count, dtype: int64

In [2471]:
# define a function to duplicate the values
def duplicate_function(x):
    return x * 2

df["Column1"].apply(duplicate_function) # apply function to each element in Column1, or use df["Column1"].apply(lambda x: x * 2)

0     2
1     8
2    14
Name: Column1, dtype: category
Categories (3, int64): [2, 8, 14]

In [2472]:
# get the first element in Column1
df["Column1"].iloc[0] # get the first element in Column1 using (integer-location) based indexing

df["Column1"].loc[2]  # get the element at index 2 in Column1 using (label) based indexing

df["Column1"].iat[0]  # get the first element in Column1 using integer based indexing, faster than iloc for single element access

df["Column1"].at[2]

df["Column1"].loc[0]  # get the first element in Column1 using label based indexing

df.loc[0, "Column1"]

np.int64(1)

In [2473]:
# use slicing to get first 3 elements in Column2
df["Column2"].iloc[0:3]  # slicing using iloc

df.iloc[1:2, 0:2] # get rows 1 to 3 and columns 0 to 1 using iloc

df.iloc[ : , : -1] # get all rows and all columns except the last one (:) for rows, (: -1) for columns except last

  Column1  Column2  Column3
0       1        2        3
1       4        5        6
2       7        8        9

In [2474]:
# Sort values

df.sort_values(["Column2", "Column1"], ascending=[1, 1]) # Col 2 asc -> F, Col 1 asc -> T

  Column1  Column2  Column3 Column4
0       1        2        3       a
1       4        5        6       b
2       7        8        9       c

In [2475]:
# Loop through DataFrame

for index, row_data in df.iterrows():
    print("Index : ", index)
    print("Data in row :\n", row_data)
    print("=========================")

Index :  0
Data in row :
 Column1    1
Column2    2
Column3    3
Column4    a
Name: 0, dtype: object
=========================
Index :  1
Data in row :
 Column1    4
Column2    5
Column3    6
Column4    b
Name: 1, dtype: object
=========================
Index :  2
Data in row :
 Column1    7
Column2    8
Column3    9
Column4    c
Name: 2, dtype: object
=========================

In [2476]:
# Filtering data

df.loc[df["Column3"] > 4][["Column1", "Column3"]]

df[(df["Column2"] > 4)&(df["Column2"] > 6)] [["Column1", "Column2"]]

df_2[df_2["City"].str.contains("o|g", case=False)] # case : False -> Upper and Lower

df_2[df_2["Name"].isin(["David", "Bob"]) & (df_2["Age"] > 27)]

df_2.query("Age > 20 and Name == \"Bob\"")

  Name  Age         City
2  Bob   27  Los Angeles

In [2477]:
# create a new column by performing operations on an existing column
new_col = df_2["Age"] + 5  # create a new column by adding 5 to the Age column

print("New column with Age + 5: \n", new_col)

New column with Age + 5:
 1    29
2    32
3    27
4    37
Name: Age, dtype: int64

In [2478]:
# add the new column to the DataFrame
df_2 = df_2.assign(Age_in_5_Years = df_2["Age"] + 5) # or use df_2["Age_in_5_Years"] = df_2["Age"] + 5

df_2["Bonus"] = np.where(df_2["Age"] > 30, 7, 6)

# display the updated DataFrame
display(df_2)

      Name  Age         City  Age_in_5_Years  Bonus
1    Alice   24     New York              29      6
2      Bob   27  Los Angeles              32      6
3  Charlie   22      Chicago              27      6
4    David   32      Houston              37      7

In [2479]:
# drop a column from the DataFrame
df_2 = df_2.drop(columns=["Age_in_5_Years"])  # drop the Age_in_5_Years column or use df_2.drop("Age_in_5_Years", axis=1, inplace=True)

# display the DataFrame after dropping the column
display(df_2)

      Name  Age         City  Bonus
1    Alice   24     New York      6
2      Bob   27  Los Angeles      6
3  Charlie   22      Chicago      6
4    David   32      Houston      7

In [2480]:
# drop a row from the DataFrame
df_2.drop(df_2.index[2], axis=0, inplace=True) # drop the row with index 2

# display the DataFrame after dropping the row
display(df_2)

    Name  Age         City  Bonus
1  Alice   24     New York      6
2    Bob   27  Los Angeles      6
4  David   32      Houston      7

In [2481]:
df_2 = df_2.rename(columns={"Name":"1st Name"})

display(df_2)

  1st Name  Age         City  Bonus
1    Alice   24     New York      6
2      Bob   27  Los Angeles      6
4    David   32      Houston      7

In [2482]:
df_2["Born date"] = ["2002-1-1", "1999-1-1", "1994-1-1"]

df_2["Born date"] = pd.to_datetime(df_2["Born date"], format="%Y-%m-%d")

df_2["Born year"] = df_2["Born date"].dt.year

df_2

  1st Name  Age         City  Bonus  Born date  Born year
1    Alice   24     New York      6 2002-01-01       2002
2      Bob   27  Los Angeles      6 1999-01-01       1999
4    David   32      Houston      7 1994-01-01       1994

In [2483]:
df_2["Age category"] = df_2["Age"].apply(lambda x : "Old" if x > 30 else "Young")

df_2

  1st Name  Age         City  Bonus  Born date  Born year Age category
1    Alice   24     New York      6 2002-01-01       2002        Young
2      Bob   27  Los Angeles      6 1999-01-01       1999        Young
4    David   32      Houston      7 1994-01-01       1994          Old

In [2484]:
df_2.to_csv(r"C:\Users\dell\DEPI_ONL4_AIS2_S2\DEPI_ONL4_AIS2_S2_ML\Data_Analysis_Course\Session_2\Code\info.csv", index=False)

In [2485]:
# create another DataFrame from a dictionary
data_3 = {"Name": ["Alice", "Bob", "Charlie", "David"],
          "Age": [24, 27, 22, 32],
          "City": ["New York", "Los Angeles", "Chicago", "Houston"]}

df_3 = pd.DataFrame(data_3, columns=["Name", "Age", "City"], index=[1, 2, 3, 4])

# display the DataFrame
display(df_3)

      Name  Age         City
1    Alice   24     New York
2      Bob   27  Los Angeles
3  Charlie   22      Chicago
4    David   32      Houston

In [2486]:
# create another DataFrame from a dictionary
data_4 = {"Name": ["Adel", "Mohamed", "Ali", "Messi"],
          "Age": [20, 22, 18, 40],
          "City": ["Tanta", "Cairo", "Giza", "Barcelona"]}

df_4 = pd.DataFrame(data_4, columns=["Name", "Age", "City"], index=[1, 2, 3, 4])

# display the DataFrame
display(df_4)

      Name  Age       City
1     Adel   20      Tanta
2  Mohamed   22      Cairo
3      Ali   18       Giza
4    Messi   40  Barcelona

In [2487]:
pd.merge(df_3, df_4, how="outer")

      Name  Age         City
0     Adel   20        Tanta
1      Ali   18         Giza
2    Alice   24     New York
3      Bob   27  Los Angeles
4  Charlie   22      Chicago
5    David   32      Houston
6    Messi   40    Barcelona
7  Mohamed   22        Cairo

In [2488]:
new_df = pd.concat([df_3, df_4], axis=0)

new_df

      Name  Age         City
1    Alice   24     New York
2      Bob   27  Los Angeles
3  Charlie   22      Chicago
4    David   32      Houston
1     Adel   20        Tanta
2  Mohamed   22        Cairo
3      Ali   18         Giza
4    Messi   40    Barcelona

In [2489]:
df_2

  1st Name  Age         City  Bonus  Born date  Born year Age category
1    Alice   24     New York      6 2002-01-01       2002        Young
2      Bob   27  Los Angeles      6 1999-01-01       1999        Young
4    David   32      Houston      7 1994-01-01       1994          Old

In [2490]:
import numpy as np

df_2.loc[[2], "Age"] = np.nan

df_2.loc[[2], "City"] = np.nan

df_2

  1st Name   Age      City  Bonus  Born date  Born year Age category
1    Alice  24.0  New York      6 2002-01-01       2002        Young
2      Bob   NaN       NaN      6 1999-01-01       1999        Young
4    David  32.0   Houston      7 1994-01-01       1994          Old

In [2491]:
# get null count for each column
null = df_2.isnull().sum() # Or use -> df_2.isna().sum()

# format the null count as a DataFrame
null_df = pd.DataFrame(null, columns=["Null_Count"])

# display the DataFrame
display(null_df)

              Null_Count
1st Name               0
Age                    1
City                   1
Bonus                  0
Born date              0
Born year              0
Age category           0

In [2492]:
# df_2 = df_2.fillna("unknown")

df_2["Age"] = df_2["Age"].interpolate() # values in middle : to overcame -> df_2["Age"] = df_2["Age"].interpolate(method='linear', limit_direction='both')

In [2493]:
df_2

  1st Name   Age      City  Bonus  Born date  Born year Age category
1    Alice  24.0  New York      6 2002-01-01       2002        Young
2      Bob  28.0       NaN      6 1999-01-01       1999        Young
4    David  32.0   Houston      7 1994-01-01       1994          Old

In [2494]:
values_counts = pd.DataFrame(df_2["Age category"].value_counts())

df_2.groupby(["Age category"])["Age"].mean()

df_2.groupby(["Age category"]).agg({"Age":"mean", "Born year":"min"})

pivot = df_2.pivot(columns="Age category", index="1st Name", values="Age")

pivot

Age category   Old  Young
1st Name
Alice          NaN   24.0
Bob            NaN   28.0
David         32.0    NaN

In [2495]:
df_2[df_2["City"].notna()]

  1st Name   Age      City  Bonus  Born date  Born year Age category
1    Alice  24.0  New York      6 2002-01-01       2002        Young
4    David  32.0   Houston      7 1994-01-01       1994          Old

In [2496]:
df_2.dropna(inplace=True)

In [2497]:
df_2

  1st Name   Age      City  Bonus  Born date  Born year Age category
1    Alice  24.0  New York      6 2002-01-01       2002        Young
4    David  32.0   Houston      7 1994-01-01       1994          Old

In [2498]:
new_df["Copy from previous row"] = new_df["Age"].shift(-1) # (-) for reverse

new_df["Age rank"] = new_df["Age"].rank()

new_df.reset_index(inplace=True)

new_df.sort_values(by="Age rank", ascending=False, inplace=True)

In [2499]:
new_df.drop(columns="index")

      Name  Age         City  Copy from previous row  Age rank
7    Messi   40    Barcelona                     NaN       8.0
3    David   32      Houston                    20.0       7.0
1      Bob   27  Los Angeles                    22.0       6.0
0    Alice   24     New York                    27.0       5.0
2  Charlie   22      Chicago                    32.0       3.5
5  Mohamed   22        Cairo                    18.0       3.5
4     Adel   20        Tanta                    22.0       2.0
6      Ali   18         Giza                    40.0       1.0

In [2500]:
new_df["Cum Age"] = new_df["Age"].cumsum()

new_df

   index     Name  Age         City  Copy from previous row  Age rank  Cum Age
7      4    Messi   40    Barcelona                     NaN       8.0       40
3      4    David   32      Houston                    20.0       7.0       72
1      2      Bob   27  Los Angeles                    22.0       6.0       99
0      1    Alice   24     New York                    27.0       5.0      123
2      3  Charlie   22      Chicago                    32.0       3.5      145
5      2  Mohamed   22        Cairo                    18.0       3.5      167
4      1     Adel   20        Tanta                    22.0       2.0      187
6      3      Ali   18         Giza                    40.0       1.0      205

In [2501]:
new_df["rolling_3_adter"] = new_df["Age"].rolling(3).sum()

In [2502]:
new_df

,index,Name,Age,City,Copy from previous row,Age rank,Cum Age,rolling_3_adter
7,4,Messi,40,Barcelona,NaN,8.0,40,NaN
3,4,David,32,Houston,20.0,7.0,72,NaN
1,2,Bob,27,Los Angeles,22.0,6.0,99,99.0
0,1,Alice,24,New York,27.0,5.0,123,83.0
2,3,Charlie,22,Chicago,32.0,3.5,145,73.0
5,2,Mohamed,22,Cairo,18.0,3.5,167,68.0
4,1,Adel,20,Tanta,22.0,2.0,187,64.0
6,3,Ali,18,Giza,40.0,1.0,205,60.0